#task1
"""
Логування часу виконання функції:
Напишіть декоратор, який вимірює час виконання певної функції і виводить його на екран.
"""
#task2
"""
Перевірка автентифікації:
Напишіть декоратор, який перевіряє, чи користувач має право доступу до певної функції.
"""

#task3
"""
Конвертація типів даних:
Напишіть декоратор, який конвертує вхідні параметри функції в певний тип даних.
"""
#task4
"""
Обробка винятків:
Напишіть декоратор, який обробляє винятки, що виникають у викликаній функції.
"""
#group_task
"""
Написати Калькулятор
Перша людина пише декоратори які виводить повідомлення про операцію і обробляти винятки
Друга людина пише функції для обрахунку
"""
#group_task2
"""
Симулятор гри у гонки
Перша людина пише функцію яка створює декоратори для обрахунку часу, винятків і повідомлень
Друга людина пише функцію для обрахунку характеристик 
і визначення переможця і створює набір даних машин з характеристиками

"""


