#task1
"""
Напишіть програму, яка створює потік, що виводить числа від 1 до 10 з інтервалом 1 секунда.
"""

#task2
"""
Створіть програму, яка паралельно виконує дві функції: одна функція виводить квадрати чисел від 1 до 10, а інша - куби тих самих чисел. Виведіть результати обох функцій.
"""
#task3
"""
Напишіть програму, яка здійснює паралельне пошук ключових слів в кількох текстових файлах у вказаній директорії.
"""

#task4
"""
Реалізуйте програму, яка паралельно виконує обчислення суми елементів великого списку чисел, розділяючи список між кількома потоками.
"""
#task5
"""
Реалізуйте програму для паралельного перевірки доступності кількох веб-сайтів за допомогою бібліотеки requests та потоків.
"""
#task6
"""
Напишіть програму з потоками де один потік буде додавати число, а інший множити на 2
"""