#task1
"""
Створення класу "Книга":

Створити клас "Книга" з атрибутами, такими як назва, автор, рік видання та кількість сторінок.
Додати метод для виведення інформації про книгу.
"""
#task2
"""
Створити клас Домашня тварина
який буде мати методи для виведення інформації(Тип тварини(кіт, собака і тд), імя тварини, вік, і тд)
Подання голосу(Наприклад якщо тип тварини собака то метод повинен виводити(Гав)
"""
#task3
"""
Використайте створений клас із попереднього завдання.
Створіть клас студент який буде містити методи для виведення іфнормації(Імя, вік, місто, курс, домашня тваринка)
присвойте для кожного студента по тваринці.
"""
#Group_task4
"""
Створити програму яка буде 
буде створювати піцу відповідно до вказаних інгредєнтів(замовлення).
І видавати користувачу.
Перша людина: Створює клас для створення піци.
Друга Людина створює клас для прийняття замовлення, передачі до виробника, видає готову піцу.
"""