#task 1
"""
Написати код який буде брати інпут і записувати у файл
Створіть програму, яка зчитує дані з файлу JSON,
 фільтрує їх за певною умовою (наприклад, вік більше 25 років),
  та зберігає результат у новому файлі JSON.
"""

#task 2
"""
створити файл json з створених словників.
Створіть програму, яка зчитує дані з файлу JSON, 
обчислює якусь статистику або агреговану інформацію (наприклад,
 середній вік співробітників у певному відділі) та створює звіт у форматі текстового файлу або JSON.
"""
#task 3
"""
Створіть програму, яка створює складену структуру даних у
 форматі JSON (наприклад, каталог товарів з кількома властивостями для кожного товару)
  та здійснює різноманітні операції з цими даними, такі як додавання, видалення та оновлення записів.
"""

#task 4
"""
Створіть програму, яка зчитує дані з файлу JSON,
 фільтрує їх за певною умовою (наприклад, вік більше 25 років),
  та зберігає результат у новому файлі JSON.
"""

#task6
"""
Створити код який буде шукати у текстовому файлі кількість входжень певного слова.
"""