#task1
"""
Напишіть функцію, яка множить два масиви. Оцініть часову складність цієї функції.
"""

#task2
"""
Напишіть програму складність якої є O(n^3)
"""

#task 3
"""
Оцінити часову складність програми
def bubble_sort(arr):
    n = len(arr)
    for i in range(n):
        for j in range(0, n-i-1):
            if arr[j] > arr[j+1]:
                arr[j], arr[j+1] = arr[j+1], arr[j]
    return arr
        
"""


#task4
"""
Напишіть дві різні програми для визначення суми елементів у списку розміром n = 500,
визначте складність цих двох програм та порівняйте час виконання за допомогою time 
"""

#task 5
"""
Ділимось на пари, одна людина пише код, інша людина визначає його складність.Міняємось.

"""




def bubble_sort(arr):
    n = len(arr)
    for i in range(n):
        for j in range(0, n-i-1):
            if arr[j] > arr[j+1]:
                arr[j], arr[j+1] = arr[j+1], arr[j]
    return arr





