#task1
"""
Напишіть клас для представлення бінарного дерева.
У цьому класі повинні бути методи для додавання нового вузла,
 пошуку елемента, видалення елемента.
"""

#task2
"""
Напишіть функцію для визначення глибини бінарного дерева.
 Глибина дерева - це максимальна довжина шляху від кореня до будь-якого листового вузла.
"""
#task3
"""
Напишіть функцію, яка приймає список значень і побудовує з них бінарне дерево.
"""

#task4
"""
Напишіть функцію для знаходження всіх листків бінарного дерева (вузлів без дітей).
"""