#task1
"""
Створіть клас BankAccount, що містить атрибути balance та account_number.
Забезпечте захищений доступ до атрибутів, тобто зробіть balance приватним, а account_number захищеним.
Додайте методи deposit() та withdraw(), які змінюють баланс рахунку.
"""
#task2
"""
Створіть клас Logger, який буде реєструвати кожний виклик методу класу.
кожен метод класу повинен автоматично реєструвати свій виклик у лог-файлі.
"""
#task3
"""
Створіть клас Database, який імітує базу даних.
додайте функціонал  
запису та читання з бази даних(json файлу), яка автоматично логує кожен запит.
"""
#group_task4
"""
Перша команда реалізовує програму Калькулятор за допомогою класів
має бути реальізовано класи(підкласи) основні математичні дії, меню, ввід - вивід, логування, і авторизація.
також старайтесь перевизначати магічні методи(чим більше тим краще).

Друга команда реалізовує програму для обчилення площ різних фігур(круг, квадрат, прямокутник,і трикутник)
має бути реальізовано класи(підкласи) обрахунок площ для різних фігур, меню, ввід - вивід, логування, і авторизація.
також старайтесь перевизначати магічні методи(чим більше тим краще).


"""