#task1
"""
Розробити програму терміналу в макдональдсі.
Користувач повинен замовляти з меню(мак-меню)
Написати функції для фільтрації інгредієнтів у замовленні.

"""
#task2
"""
Написати усі варіанти рахування суми списку(не менше 3)
і порівняти їх час виконання за допомогою timeit
"""
#task3
"""
створити для кожної математичної операції 
функцію яка буде використовуватись як змінна.
Також зробіть функцію у яку буде 
передаватись матматична створена функція-змінна і буде викликатись
"""

#task4


#group_task3
"""
Менеджер завдань:
Програма дозволяє користувачу створювати, переглядати, видаляти та відзначати завдання як виконані.
Користувач може встановлювати терміни виконання та пріоритети завдань. 
Також додати ролі для цієї програми, наприклад тільки адмін може перенести якусь задачу у closed статус
додати відповідні перевірки.
Список можливих статусів задач: to do, in progress, done, closed,
"""

