#task1
"""
Напишіть програму, яка використовує мультипроцесинг для генерації великої кількості випадкових чисел.
Кожен процес може генерувати числа в окремому діапазоні.
"""

#task2
"""
Напишіть програму, яка використовує мультипроцесинг для пошуку певного елемента у великому списку.
Розділіть список на підсписки та надішліть кожен підсписок окремому процесу для пошуку.
"""

#task3
"""
Реалізуйте програму для обчислення факторіалів чисел, яка використовує мультипроцесинг для розпаралелювання обчислень.
"""
#task4
"""
Напишіть скрипт для завантаження веб-сторінок з Інтернету з використанням мультипроцесингу.
Кожен процес може завантажувати сторінку окремо.
"""