#group_task1
"""
Написати автоматизовану бібліотеку для студентів.
Яка буде містити систему видачі книжок сутденту, систему журналу(логування дій у системі, запис їх у журнал)
Також повинна бути створена 'база книжок'.
Для журналу і бази  можна використовувати json, csv або txt.
"""

#group_task2
"""
Написати код який приймає текстовий файл і зашифровує текст у цьому файлі
В результаті повинен зявитись файл із зашифрованим текстом.
Також написати код який буде розшифровувати файл.
Також потрібно, написати код, що буде просити у користувачів ввести пароль.
Якщо пароль неправильний то доступ до файлу не буде отримано.
Якщо пароль правильний то файл буде розшифровано.
Якщо три рази підряд буде введено невірний пароль то файл буде видалено.
Створити кілька користувачів для перевірки.
"""
#group_task3
"""
Менеджер завдань:
Програма дозволяє користувачу створювати, переглядати, видаляти та відзначати завдання як виконані.
Користувач може встановлювати терміни виконання та пріоритети завдань. 
Також додати ролі для цієї програми, наприклад тільки адмін може перенести якусь задачу у closed статус
додати відповідні перевірки.
Список можливих статусів задач: to do, in progress, done, closed,
"""


#home_task
"""
Розробіть програму для зберігання паролів.
"""
#home_task variant 2
"""
Зробіть простого чат-бота,
який може відповідати на прості питання користувача.
"""