#task1
"""
Задайте функцію, яка повертає суму двох чисел.
Створіть тести, що перевіряють правильність роботи цієї функції для різних комбінацій чисел.
"""
#task2
"""
Створіть клас для представлення книги. 
Додайте методи для отримання/зміни інформації про книгу (назва, автор, рік видання тощо). Напишіть тести для перевірки цих методів.
"""
#task3
"""
Створіть функцію, яка ділить одне число на інше.
 Перевірте, чи викидає ця функція виняток, коли дільник дорівнює нулю. 
 Напишіть тест, щоб переконатися, що цей виняток обробляється правильно.
"""
#group_task4
"""
Одна людина пише код для авторизації на сайті.
має бути перевірка імені користувача і паролю (їх можна зберігати у словнику).Розробити це за допомогою методів класу.

Друга людина пише тести до цієї програми.
"""