#task1
"""
Створіть програму, яка виконує паралельно три асинхронні функції: функція, яка чекає 1 секунду, функція, яка чекає 2 секунди, і функція, яка чекає 3 секунди. Виведіть час виконання кожної функції.
Кожна функція повинна виводити якесь повідомлення на екран
"""
#task 2
"""
Напишіть програму, яка асинхронно зчитує введений користувачем рядок, чекаючи на введення протягом 10 секунд. Якщо введення не отримане, виведіть повідомлення про тайм-аут.
"""

#task3
"""
Напишіть програму, яка паралельно завантажує вміст кількох веб-сторінок за допомогою асинхронних HTTP-запитів і виводить заголовки кожної сторінки.
"""
#task4
"""
Створіть програму, в якій дві асинхронні функції спільно використовують asyncio.Queue для передачі даних одна одній. Одна функція генерує дані і поміщає їх у чергу, а інша функція витягує дані з черги та їх обробляє.
Розробіть першу функцію для приймання повідомлень у терміналі, передачу даних через asynicio.Queue і другу функцію яка буде відповідати на ці повідомлення.
"""