#task1
"""
Створіть функцію, яка перевіряє, чи є граф зв'язним
(тобто чи можна дістатися з будь-якої вершини до будь-якої іншої).
"""

#task2
"""
Напишіть програму, яка знаходить найкоротший шлях між двома вершинами у зваженому графі за допомогою алгоритму Дейкстри.
"""

"""
Ініціалізація:
    Починаємо з початкової вершини. Встановлюємо відстань до неї як 0, а до всіх інших вершин як нескінченність. 
    Використовуємо масив для збереження найкоротших відстаней.
Обробка вершин: 
    Обираємо вершину з найменшою відстанню до неї, яку ще не обробили. 
    Це можна реалізувати, наприклад, за допомогою пріоритетної черги. 
    Позначаємо цю вершину як оброблену.
Оновлення відстаней: 
    Для кожної сусідньої вершини, яка не є обробленою, перевіряємо, чи можна досягти її з поточної вершини коротшим шляхом, ніж поточна відома відстань. 
    Якщо так, оновлюємо відстань до цієї вершини.
Повторюємо: 
    Повторюємо кроки 2 і 3 для всіх вершин графа, поки всі вершини не будуть оброблені.
Результат: 
    Після завершення алгоритму ми отримаємо масив, в якому будуть збережені найкоротші відстані від початкової вершини до кожної іншої вершини.
"""

#task3
"""
Розробіть алгоритм, який знаходить найкоротший шлях у графі, який не перевищує задану кількість кроків.
"""