#task1
"""
Створіть батьківський клас Shape,
який має метод area() для обчислення площі.
 Створіть підкласи Circle і Rectangle,
 які успадковують клас Shape і мають свої власні
 методи area() для обчислення площі круга і прямокутника відповідно.
"""
#task2
"""
Створіть клас Employee, який містить ім'я
 та заробітну плату працівника. 
 Створіть підклас Manager, який успадковує клас 
 Employee і має додатковий атрибут, 
 такий як кількість підлеглих співробітників. 
 Перевизначте метод виведення інформації про 
 працівника для Manager, щоб він включав інформацію про кількість підлеглих співробітників.
"""

#task3
"""
Створіть клас Vector,
 який представляє собою вектор у тривимірному просторі.
  Перевизначте магічний метод __add__() для додавання двох векторів,
   а також метод __mul__() для множення вектору на скаляр.
"""

#task4
"""
Напишіть клас Matrix, який представляє матрицю.
 Перевизначте магічний метод __getitem__() для доступу до елементів матриці.
"""
#group_task
"""
Створіть базовий клас Employee,
 який містить інформацію про працівника. 
 Від цього класу успадковуються класи Manager,
  Developer, Designer тощо. 
  Перевизначте магічний метод __str__(),__cal__(), функція для збільшення зп __del__()
  Функція для звільнення працівника, функція для підвишення працівника.
"""


