#task1
"""
Контекстний менеджер для вимірювання часу виконання коду:
Створіть контекстний менеджер, який вимірює час виконання блоку коду, який ви хочете виміряти.
Створіть клас з методами __enter__ та __exit__. для вимірювання часу використовуйте time.
"""

#task2
"""
Розробіть контекстний менеджер, який буде записувати всі дії, які відбуваються всередині нього, у журнал.
Журнал - це звичайний текстовий файл.
"""

#task3
"""
Реалізуйте контекстний менеджер, який автоматично створює та видаляє тимчасову папку для роботи з файлами.
"""

#task4
"""
Створіть контекстний менеджер який відкриває тектсовий файл і видаляє з нього усі слова які повторюються.
Також він повинен записати усі слова які видалив у окремий файл.
"""