#task1
"""
Написати функцію для алгоритму бінарного пошуку числа у списку.
"""
#task2
"""
Написати функцію для алгоритму лінійного пошуку числа у списку.
Перевірити функції з 1 та 2 завдання за допомогою timeit( перевіряти на великих масивах)
"""
#task3
"""
Створіть хеш-таблицю, яка дозволяє зберігати ім'я та вік людини, і реалізуйте функцію пошуку за ім'ям.
"""

#task4
"""
Створіть програму для перетворення римських чисел у десяткові та навпаки,
використовуючи хеш-таблицю для зберігання відповідностей символів та чисел
"""