#task1
"""
Переписати код сереверу, щоб сервер чекав на новий запит від клієнта
"""

#task2
"""
Дописати клієнт і сервер(клієнт повинен надсилати запит з ключовим словом, сервер повинен повернути знайдені дані по ключовому слову)
Дані повинні зберігатись у файлі json.
"""

#task3
"""
Доповнити код попереднього завдання,
сервер повинен шукати дані по ключовому слову, якщо він не знайде ці дані,  то повинен надіслати запит на інший сервер.
Тобто, потрібно реалізувати ще один сервер.

"""
#task4
"""
Доповнити код попереднього завдання.
Клієнт повинен надсилати запит на сервер. Сервер повинен зберігати дані у файлі. 
Приклад:
Дані: ["hello","wolrd"], Місце збереження: file.json, якщо сервер_1 має доступ до цього файлу то зберігаємо, якщо ні то передаємо на сервер2
"""
