#task1
"""
Напишіть декоратор, який запускає функцію з певною періодичністю.
"""
#task2
"""
Реалізуйте декоратор, який веде підрахунок кількості викликів певної функції.
"""
#task3
"""
Створіть клас, у якому @property використовується для обчислення кубічного кореня заданого числа.
"""
#task4
"""
Створіть клас, у якому @property використовується для автоматичного обчислення знижки на товар у залежності від його віку.
"""
#task5
"""
Створіть клас, який використовує @classmethod для створення об'єктів цього класу з різними параметрами.
Для прикладу: Обєкт класу можна створювати напряму передаючи аргументи, витягаючи аргументи з стрічки,
витягаючи аргументи з файлу, тощо.
"""
#task6
"""
Використовуйте @classmethod, щоб підрахувати кількість екземплярів класу.
"""
#task7
"""
Створіть клас , який містить статичний метод для виведення інформації про цей клас(інформація про те для чого цей клас використовуюється).
"""
#task 8
"""
Створіть клас DateTimeUtils, який містить статичний метод для отримання поточної дати та часу.
"""




