#task1
"""
Створіть клас, що використовує дескриптор для обмеження доступу до атрибуту
"""
#task2
"""
Створіть клас, в якому використовуються @property для забезпечення обмеженого доступу до деяких атрибутів
"""
#task3
"""
Створіть клас, що використовує дескриптор для обчислення площі прямокутника.
 Використовуйте @classmethod, щоб створити прямокутник за допомогою ширини та висоти
"""
#task4
"""
Створіть клас, що використовує дескриптор для зберігання
 та обробки інформації про час у форматі годин:хвилини:секунди. 
 Використовуйте @staticmethod, щоб конвертувати час з рядка в об'єкт часу та навпаки
"""
#task 5
"""
Напишіть клас який буде зберігати значення віку кількох людей
також Напишіть власний дескриптор який заборонить зберігання відємних чисел у змінній age
напишіть функціонал який заборонить доступ до найбільшого віку і до найменшого.
Порахуйте суму всіх значень і виведіть. Використайте @classmethod, @property і @staticmethod/
"""

