#task1
"""
Отримайте дані сторінки за адресою :https://en.wikipedia.org/wiki/Python виведіть на екран заголовок сторінки.
"""

#task2
"""
Напишіть скрипт який буде виконувати пошук по ключовим словам за адресою: https://github.com/search?q={search_keywords}&type={search_type}"
у search_keywords потрібно передавати масив з ключовими словами по яким буде відбуватись пошук.
у search_type потрібно вказувати по чому саме потрібно вказати.
Наприклад якщо вказати search_keywords = ['python'] і search_type = 'Repositories' Тоді ми отримаємо дані про репозиторії з python які є на гітхабі.
Підказка: В результаті ви можете отримати json з якого потрібно витягнути лише назви цих репозотріїв.
"""

#task3
"""
Напишіть скрипт який буде виводи усі теги які є на сторінці. https://en.wikipedia.org/wiki/Python
"""