
#task 1
"""
Напишіть програму, яка перевіряє, чи є введене
користувачем число простим. Обробіть виняток для
випадку, коли користувач вводить не ціле число.
"""


#task2
"""
 Напишіть програму, яка підраховує кількість входжень
  певного символу в рядок. Врахуйте випадок, коли введено символ,
   який не може бути знайдений у рядку, і виведіть відповідне повідомлення про помилку.
"""

#task 3
"""
Розробіть калькулятор, який виконує операції додавання,
 віднімання, множення та ділення двох чисел. Врахуйте винятки,
  такі як ділення на нуль або введення нечислових значень.
"""

#task 4
"""
Створіть програму для авторизації користувачів,
 де вони повинні вводити свої імена та паролі. Обробіть виняток 
 для випадку, коли введено неправильний пароль або ім'я користувача.
"""


#task 5
"""
Напишіть програму яка буде викликати помилку якщо користувач почне вводити не цифри
 і записувати те що ввів користувач у словник {те що ввів користувач: повідомлення про помилку}
 після цього продовжити приймати ввід від користувача.
 Вкінці вивести на екран словник.
"""


#task 6
"""
Напишіть програму, яка приймає шлях до файлу
 від користувача та намагається відкрити цей файл. 
 Обробіть винятки, які можуть виникнути при спробі відкриття файлу,
  наприклад, відсутність файлу або відмова у доступі.
"""
